app/views/users/_show.html.erb

              <i class="glyphicon glyphicon-comment"></i>
              <%= link_to "#{post.post_comments.count} コメント", post_path(post.id) %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 7]]