app/views/users/index.html.erb

							<p>Name：<%= link_to user.name, user_path(user) %></p>
							<p>投稿件数：<%= link_to user.posts.count, user_path(user) %>件</p>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]