app/views/users/show.html.erb

                    <i class="fa fa-comment"></i>
                    <%= link_to "#{post.post_comments.count} コメント", post_path(post.id) %>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 3]]