app/views/home/top.html.erb

                  <i class="fa fa-comment"></i>
                  <%= link_to "#{post.post_comments.count} コメント", post_path(post.id) %>
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 2]]