app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]
---
                    <i class="glyphicon glyphicon-comment"></i>
                    <%= link_to "#{post.post_comments.count} コメント", post_path(post.id) %>