app/views/posts/show.html.erb

                      <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
                      <%= @post.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 2]]

                      <i class="fa fa-heart" aria-hidden="true" style="color: black;"></i>
                      <%= @post.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 2]]

                <i class="fa fa-comment"></i>
                <a href="#comments"><%= @post.post_comments.count %></a>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 7]]

            <div class="float-wrapper">
                <h4 class="comment-count"><%= @post.post_comments.count %>件コメント</h4>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 5]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 7]]

            <ol>
              <% @post.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 7]]