app/controllers/home_controller.rb

  def top
  	@posts = Post.all.reverse_order
  	@posts = Post.page(params[:page]).per(18)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC
SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 18], ["OFFSET", 0]]