app/controllers/posts_controller.rb

INSERT INTO "posts" ("dive_point", "image_id", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
    	@post = Post.new(post_params)
    	@post.user_id = current_user.id
    	if @post.save

SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
    def index
    	@posts = Post.all
        @posts = Post.page(params[:page]).per(10)