app/views/layouts/_favorites.html.erb

                <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
                <%= post.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 3]]

				<i class="fa fa-heart" aria-hidden="true" style="color: glay;"></i>
                <%= post.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 3]]