app/views/layouts/_sidebar.html.erb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---

			<p>投稿件数：<%= user.posts.count %>件</p>